{
    "states": {
        "_start": {
            "bodyText": "To help you on your journey, we have organized our advice by management branch.",
            "type": "multipleChoice",
            "choices": [
                {
                    "text": "Pick a branch",
                    "goesTo": "_pickbranch"
                },
                {
                    "text": "Get help picking a branch",
                    "goesTo": "q0"
                }
            ]
        },
        "_pickbranch": {
            "bodyText": "Choose a branch:",
            "type": "multipleChoice",
            "choices": [
                {
                    "text": "Human Resources",
                    "goesTo": "_pick_hr",
                    "branch": "Human Resources",
                    "title": "Pick a Sub-branch"
                },
                {
                    "text": "Product Design",
                    "goesTo": "branch_pd_start",
                    "branch": "Product Design",
                    "title": "Product Design: Circular-Driven Designs"
                },
                {
                    "text": "Supply Chain",
                    "goesTo": "branch_sc_start",
                    "branch": "Supply Chain",
                    "title": "Supply Chain: Sustainable Material Sourcing"
                },
                {
                    "text": "Marketing",
                    "goesTo": "branch_mark_pd_start",
                    "branch": "Marketing",
                    "title": "Marketing: Purpose-Driven Marketing"
                }
            ]
        },
        "_pick_hr": {
            "bodyText": "Choose a Human Resources sub-branch:",
            "type": "multipleChoice",
            "choices": [
                {
                    "text": "Employee Wellbeing",
                    "goesTo": "branch_hr_ew_start",
                    "branch": "Human Resources",
                    "title": "Human Resources: Employee Wellbeing"
                },
                {
                    "text": "Strategic Planning",
                    "goesTo": "branch_hr_sp_start",
                    "branch": "Human Resources",
                    "title": "Human Resources: Strategic Planning"
                },
                {
                    "text": "Co-creation of Sustainability",
                    "goesTo": "branch_hr_ccs_start",
                    "branch": "Human Resources",
                    "title": "Human Resources: Co-creation of Sustainability"
                }
            ]
        },


        "q0": {
            "bodyText": "Is your company's reputation with the public important? (Select the most fitting option)",
            "type": "multipleChoice",
            "choices": [
                {
                    "text": "Yes: I want my company to be iconic, to be known for our values and the causes we support",
                    "goesTo": "branch_mark_pd_start",
                    "branch": "Marketing",
                    "title": "Marketing: Purpose-Driven Marketing"
                },
                {
                    "text": "Yes: I want to be known for being a good employer and an attractive place to work",
                    "goesTo": "q2"
                },
                {
                    "text": "Yes: I want to be known for developing sustainable products",
                    "goesTo": "q1"
                },
                {
                    "text": "Not particularly: I care more about planning out my goals and ensuring that my workforce is capable of achieving them",
                    "goesTo": "branch_hr_sp_start",
                    "branch": "Human Resources",
                    "title": "Human Resources: Strategic Planning"
                }
            ]
        },
        "q1": {
            "bodyText": "What is the most important factor in developing sustainable products for you? (Select the most fitting option)",
            "type": "multipleChoice",
            "choices": [
                {
                    "text": "A happy employee: you can't have sustainable products if your workers suffer",
                    "goesTo": "branch_hr_ew_start",
                    "branch": "Human Resources",
                    "title": "Human Resources: Employee Wellbeing"
                },
                {
                    "text": "The product's design: creating products that are easy to repair/recycle",
                    "goesTo": "branch_pd_start",
                    "branch": "Product Design",
                    "title": "Product Design: Circular-Driven Designs"
                },
                {
                    "text": "The materials I use in my products: sourcing sustainably ensures I don't damage the environment, or I might even be able to help regenerate it",
                    "goesTo": "branch_sc_start",
                    "branch": "Supply Chain",
                    "title": "Supply Chain: Sustainable Material Sourcing"
                }
            ]
        },
        "q2": {
            "bodyText": "Out of the following options, what is your priority for your employees?",
            "type": "multipleChoice",
            "choices": [
                {
                    "text": "Their wellbeing: I want them to be happy working for me",
                    "goesTo": "branch_hr_ew_start",
                    "branch": "Human Resources",
                    "title": "Human Resources: Employee Wellbeing"
                },
                {
                    "text": "Their potential contributions: I believe in listening to their ideas and giving them a chance at implementation",
                    "goesTo": "branch_hr_ccs_start",
                    "branch": "Human Resources",
                    "title": "Human Resources: Co-creation of Sustainability"
                }
            ]
        },


        "branch_mark_pd_start": {
            "bodyText": "Does your company have a set of core values, that are enforced within the business and broadcast to the public?",
            "type": "multipleChoice",
            "choices": [
                {
                    "text": "Yes",
                    "goesTo": "mark_pd_0"
                },
                {
                    "text": "Yes, but not enforced",
                    "goesTo": "mark_pd_1"
                },
                {
                    "text": "Yes, but not broadcast",
                    "goesTo": "mark_pd_2"
                },
                {
                    "text": "No",
                    "goesTo": "mark_pd_3"
                }
            ]
        },
        "mark_pd_1": {
            "bodyText": "It is important to also enforce the values you talk about towards the public within your company. Else, you might get accused of greenwashing, and that will destroy your positive brand image.",
            "type": "information",
            "goesTo": "mark_pd_0"
        },
        "mark_pd_2": {
            "bodyText": "If you are already adhering to a set of values within the company, those can be a powerful marketing tool towards the public: you might gain customers who share your views simply by telling them about what you value.",
            "type": "information",
            "goesTo": "mark_pd_0"
        },
        "mark_pd_3": {
            "bodyText": "It can be useful to have a set of values to adhere to that you can then tell the public about. Employees might feel more of a sense of purpose with them, and the public might be able to relate to you as a business entity more.",
            "type": "information",
            "goesTo": "mark_pd_0"
        },
        "mark_pd_0": {
            "bodyText": "Is there a social cause or similar that you as a company support?",
            "type": "multipleChoice",
            "choices": [
                {
                    "text": "Yes, and it is in line with our values or we do not have values",
                    "goesTo": "mark_pd_4"
                },
                {
                    "text": "Yes, but it clashes with our values",
                    "goesTo": "mark_pd_5"
                },
                {
                    "text": "No, because we can't find any that adhere to our values",
                    "goesTo": "mark_pd_5.5"
                },
                {
                    "text": "No, for other reasons",
                    "goesTo": "mark_pd_6"
                }
            ]
        },
        "mark_pd_5": {
            "bodyText": "It might be worth to either change your values to align better with the cause you support, or to change the cause itself. The goal is to present a unified front to your target audience, not to confuse them.",
            "type": "information",
            "goesTo": "mark_pd_4"
        },
        "mark_pd_5.5": {
            "bodyText": "It can be beneficial to your image to align yourself with a social cause, but if there are none, you might want to consider creating one based on your values. You might be able to ask your employees for ideas if you don't have any (see also the HR: Co-creation branch)",
            "type": "information",
            "goesTo": "mark_pd_4"
        },
        "mark_pd_6": {
            "bodyText": "Finding a social cause to support will make your customer like your brand more. It might also give your employees more of a sense of purpose, to feel that they're supporting something outside of the company with their work there.",
            "type": "information",
            "goesTo": "mark_pd_4"
        },
        "mark_pd_4": {
            "bodyText": "When marketing products, what does your company focus on?",
            "type": "multipleChoice",
            "choices": [
                {
                    "text": "Showcase the qualities of the product, e.g. say it is cheaper than the competition",
                    "goesTo": "mark_pd_7"
                },
                {
                    "text": "Present the company's values and causes that it supports, show what will be done with profits made",
                    "goesTo": "mark_pd_8"
                },
                {
                    "text": "Market towards a certain target audience or lifestyle, e.g. show an athletic person using your product to perform better",
                    "goesTo": "mark_pd_7"
                }
            ]
        },
        "mark_pd_7": {
            "bodyText": "Your marketing approach is focused on making people want a product for the sake of having the product. With younger generations, this approach will work less and less effectively. Consider switching to a more socially aware branding strategy.",
            "type": "information",
            "goesTo": "mark_pd_8"
        },
        "mark_pd_8": {
            "bodyText": "",
            "type": "final"
        },


        "branch_hr_ew_start": {
            "bodyText": "What is the place of an employee in your company?",
            "type": "multipleChoice",
            "choices": [
                {
                    "text": "To work for me - I already have a very defined vision of what I want to do",
                    "goesTo": "branch_hr_ew_1.1"
                },
                {
                    "text": "To help build this company with me - I prefer a more horizontal management style and want their input",
                    "goesTo": "branch_hr_ew_2"
                }
            ]
        },
        "branch_hr_ew_1.1": {
            "bodyText": "Employees have increased productivity if they feel like they have a say in the goings-on of their place of work. Think: are there any ways in which you could use their input/expertise?",
            "type": "information",
            "goesTo": "branch_hr_ew_2"
        },
        "branch_hr_ew_2": {
            "bodyText": "Does your company have an explicitly stated purpose outside of making profit?",
            "type": "multipleChoice",
            "choices": [
                {
                    "text": "No, that is our main and only focus",
                    "goesTo": "branch_hr_ew_2.1"
                },
                {
                    "text": "Yes, to provide customers with our products",
                    "goesTo": "branch_hr_ew_2.1"
                },
                {
                    "text": "Yes, we are committed to a cause that does not directly benefit us to support",
                    "goesTo": "branch_hr_ew_3"
                }
            ]
        },
        "branch_hr_ew_2.1": {
            "bodyText": "It is good to have an explicitly stated purpose outside of the obvious ones (making profit, providing product). Employees stand to gain more of a sense of purpose working for you and deriving meaning from their job.",
            "type": "information",
            "goesTo": "branch_hr_ew_3"
        },
        "branch_hr_ew_3": {
            "bodyText": "How many hours per week do your employees work on average?",
            "type": "multipleChoice",
            "choices": [
                {
                    "text": "A normal 40 hour work week",
                    "goesTo": "branch_hr_ew_3.1"
                },
                {
                    "text": "A reduced work week",
                    "goesTo": "branch_hr_ew_3.2"
                },
                {
                    "text": "They work flexible hours that they choose",
                    "goesTo": "branch_hr_ew_4"
                }
            ]
        },
        "branch_hr_ew_3.1": {
            "bodyText": "The 40 hour work week is in the process of being phased out in various countries and industries. With the level of automation we enjoy in society, it is simply no longer necessary, and less work hours per week has been shown to be beneficial to employees' mental health. Consider ways in which you can lower working hour requirements, if possible, and consider hybrid hour structures/letting your employees choose when and how long they work.",
            "type": "information",
            "goesTo": "branch_hr_ew_4"
        },
        "branch_hr_ew_3.2": {
            "bodyText": "Reduced working hours is a big step in the right direction - employees also enjoy being able to choose their own working hours. Investigate whether or not this model is a fit for your business.",
            "type": "information",
            "goesTo": "branch_hr_ew_4"
        },
        "branch_hr_ew_4": {
            "bodyText": "How is the workload (not hours!) distributed amongst your employees?",
            "type": "multipleChoice",
            "choices": [
                {
                    "text": "Everyone has a load that is appropriate for their job description and capabilities",
                    "goesTo": "branch_hr_ew_5"
                },
                {
                    "text": "Workload is difficult to distribute equally, some employees have more work than others, but are compensated equally",
                    "goesTo": "branch_hr_ew_4.1"
                },
                {
                    "text": "Unsure",
                    "goesTo": "branch_hr_ew_4.2"
                },
                {
                    "text": "Workload is difficult to distribute equally, employees do not get different wages based on their workload",
                    "goesTo": "branch_hr_ew_4.2"
                }
            ]
        },
        "branch_hr_ew_4.1": {
            "bodyText": "Compensating employees differently based on workloads is logically correct, though it is a difficult system to balance: ensure that the balance is never off, that other employees do not get jealous, that the extra workload is taken on because the employee is capable and does not just need cash, ensuring that employees with extra load do not experience excessive stress because of it...",
            "type": "information",
            "goesTo": "branch_hr_ew_5"
        },
        "branch_hr_ew_4.2": {
            "bodyText": "It can be that sometimes, workload is impossible to distribute equally. In this case, look into hiring employees for differing amounts of hours, having them on-call, or compensating them for their extra effort. Though, it is a difficult system to balance, and your priority should be to ensure that no employee is overly stressed by their workload.",
            "type": "information",
            "goesTo": "branch_hr_ew_5"
        },
        "branch_hr_ew_5": {
            "bodyText": "Where do your employees work?",
            "type":"multipleChoice",
            "choices": [
                {
                    "text": "In the office/factory, because we prefer everyone to be together when they work for maximum productivity",
                    "goesTo": "branch_hr_ew_5.1"
                },
                {
                    "text": "In the office/factory, because our work cannot be done from home",
                    "goesTo": "branch_hr_ew_6"
                },
                {
                    "text": "Hybrid options: employees can choose to work from home or the office on some days",
                    "goesTo": "branch_hr_ew_6"
                }
            ]
        },
        "branch_hr_ew_5.1": {
            "bodyText": "Employees have been shown to prefer hybrid or even fully work-from-home options, as it increases their independence, or they may have a family situation. Look into whether this is possible for your situation, which infrastructure to adapt...",
            "type": "information",
            "goesTo": "branch_hr_ew_6"
        },
        "branch_hr_ew_6": {
            "bodyText": "What happens if something happens to an employee that (temporarily) diminishes their capability to work?",
            "type": "multipleChoice",
            "choices": [
                {
                    "text": "Nothing changes, we don't have that flexibility",
                    "goesTo": "branch_hr_ew_6.1"
                },
                {
                    "text": "We have managers trained to handle these situations case-by-case and the resources to facilitate solutions they come up with",
                    "goesTo": "branch_hr_ew_end"
                },
                {
                    "text": "Employees have sufficient time off available to deal with events in their own time",
                    "goesTo": "branch_hr_ew_6.2"
                }
            ]
        },
        "branch_hr_ew_6.1": {
            "bodyText": "It may be worth looking into training your management to handle employee situations nonetheless, as research shows that even just having this option improves employee morale.",
            "type": "information",
            "goesTo": "branch_hr_ew_end"
        },
        "branch_hr_ew_6.2": {
            "bodyText": "Giving employees sufficient time off is a step in the good direction, though having systems in place and managers trained explicitly to deal with individual situations can improve employee morale and your ability to handle these situations.",
            "type": "information",
            "goesTo": "branch_hr_ew_end"
        },
        "branch_hr_ew_end": {
            "bodyText": "",
            "type": "final"
        },

        "branch_hr_sp_start": {
            "bodyText": "Are you aware of the current knowledge and skill levels of your workforce?",
            "type": "multipleChoice",
            "choices": [
                {
                    "text": "Yes.",
                    "goesTo": "branch_hr_sp_2"
                },
                {
                    "text": "No.",
                    "goesTo": "branch_hr_sp_1.1"
                }
            ]
        },
        "branch_hr_sp_1.1": {
            "bodyText": "You should be aware of what your employees are and are not capable of, both to avoid overloading them with work they cannot do and to adequately estimate progress towards your goals as a company.",
            "type": "information",
            "goesTo": "branch_hr_sp_2"
        },
        "branch_hr_sp_2": {
            "bodyText": "Are you aware of which skills, employees and resources you need for your goals?",
            "type": "multipleChoice",
            "choices": [
                {
                    "text": "Yes.",
                    "goesTo": "branch_hr_sp_3"
                },
                {
                    "text": "No.",
                    "goesTo": "branch_hr_sp_2.1"
                }
            ]
        },
        "branch_hr_sp_2.1": {
            "bodyText": "You should be aware of what it will take to reach your goals. To orient yourself in the problem you want to solve, you must know what it consists of.",
            "type": "information",
            "goesTo": "branch_hr_sp_3"
        },
        "branch_hr_sp_3": {
            "bodyText": "Are the skills of your employees and the requirements for your goals a good match?",
            "type": "multipleChoice",
            "choices": [
                {
                    "text": "I don't know: I need to investigate either/both of these further.",
                    "goesTo": "branch_hr_sp_end"
                },
                {
                    "text": "Yes.",
                    "goesTo": "branch_hr_sp_end"
                },
                {
                    "text": "No: my employees are more skilled than my goals require.",
                    "goesTo": "branch_hr_sp_3.1"
                },
                {
                    "text": "No: my goals require more skilled employees.",
                    "goesTo": "branch_hr_sp_3.2"
                }
            ]
        },
        "branch_hr_sp_3.1": {
            "bodyText": "Having more human skill in your arsenal than you require can be good news! You can be more ambitious with your goals, or downsize your workforce if you must.",
            "type": "information",
            "goesTo": "branch_hr_sp_end"
        },
        "branch_hr_sp_3.2": {
            "bodyText": "If your goals are too ambitious for your current workforce to achieve, either consider lowering them or work to expand your workforce and their skills to fit your needs. Recruit, (re)train, organize workshops and skill development labs, or outsource work.",
            "type": "information",
            "goesTo": "branch_hr_sp_end"
        },
        "branch_hr_sp_end": {
            "bodyText": "",
            "type": "final"
        },

        "branch_hr_ccs_start": {
            "bodyText": "Do your employees have opportunities to offer up ideas for how the company functions?",
            "type": "multipleChoice",
            "choices": [
                {
                    "text": "Yes, and we make sure that employees know about them.",
                    "goesTo": "branch_hr_ccs_2"
                },
                {
                    "text": "Yes, but they are not our focus, so they are not brought up a lot.",
                    "goesTo": "branch_hr_ccs_1.1"
                },
                {
                    "text": "No, there is no leeway in how the company functions right now.",
                    "goesTo": "branch_hr_ccs_1.2"
                }
            ]
        },
        "branch_hr_ccs_1.1": {
            "bodyText": "It is great that you have channels to listen to your employees' ideas, but by not making sure they all know about these channels, you may be missing out on some great ideas. Send some emails, post a flyer, tell your managers to talk to the employees they supervise about it. Offer up a prize for the idea that gets implemented!",
            "type": "information",
            "goesTo": "branch_hr_ccs_2"
        },
        "branch_hr_ccs_1.2": {
            "bodyText": "Employees are the heart of how many businesses function. They often know and understand the functions of your business on a deep level, and by not giving them a place to generate ideas, you may be missing out on initiatives that could greatly improve your productivity or brand image.",
            "type": "information",
            "goesTo": "branch_hr_ccs_end"
        },
        "branch_hr_ccs_2": {
            "bodyText": "Do your employees' ideas get processed/listened to/implemented?",
            "type": "multipleChoice",
            "choices": [
                {
                    "text": "Not really/not often, we mostly have this to let employees feel like they're being heard.",
                    "goesTo": "branch_hr_ccs_2.1"
                },
                {
                    "text": "Whenever possible, if the idea brings us profit, we will implement it.",
                    "goesTo": "branch_hr_ccs_2.2"
                },
                {
                    "text": "We review every idea and if we can easily implement it, we do. Whatever loss in profits this causes is worth the increase in employee satisfaction and engagement.",
                    "goesTo": "branch_hr_ccs_end"
                }
            ]
        },
        "branch_hr_ccs_2.1": {
            "bodyText": "Soliciting ideas from your employees and then not listening to them is very bad HR practice. If this comes out, you will get a bad name amongst employees. You should assign someone to start reading through the backlog of ideas immediately, and implement better practices for handling input as it comes it.",
            "type": "information",
            "goesTo": "branch_hr_ccs_end"
        },
        "branch_hr_ccs_2.2": {
            "bodyText": "Listening to your employees' ideas to the point of implementing them is a great first step. Ideas that are not immediately profitable might still be worth considering: maybe they will increase how the company engages with certain values, such as sustainability, and implementing these ideas may still increase employee satisfaction by a great degree.",
            "type": "information",
            "goesTo": "branch_hr_ccs_end"
        },
        "branch_hr_ccs_end": {
            "bodyText": "",
            "type": "final"
        },


        "branch_pd_start": {
            "bodyText": "How robust is your product?",
            "type": "multipleChoice",
            "choices": [
                {
                    "text": "Single-use.",
                    "goesTo": "branch_pd_1.1"
                },
                {
                    "text": "It will last for the period of the warranty.",
                    "goesTo": "branch_pd_1.2"
                },
                {
                    "text": "It will last as long as we can make it last.",
                    "goesTo": "branch_pd_1.3"
                },
                {
                    "text": "Our product is actually the service our product provides: e.g. we provide the service of 'light' and maintain the lightbulbs in a building for a recurring fee instead of just selling lightbulbs.",
                    "goesTo": "branch_pd_2"
                }
            ]
        },
        "branch_pd_1.1": {
            "bodyText": "Single-use product design is often born out of a desire for convenience. Does a multi-use version of your current product exist? It may be the case that your target audience, becoming more climate-conscious, will prefer reusable products over convenient single-use ones.",
            "type": "information",
            "goesTo": "branch_pd_2"
        },
        "branch_pd_1.2": {
            "bodyText": "Products are supposed to last the period of the warranty, but if they remain usable beyond that, your brand will become known for high product quality. Everyone knows the joke about how if you throw a Nokia brick phone at a wall, it is the wall that will break. Aim for the infamous longevity of Nokia bricks.",
            "type": "information",
            "goesTo": "branch_pd_2"
        },
        "branch_pd_1.3": {
            "bodyText": "Your product is as good as you can make it, congratulations! Have you considered, instead of just offering the products, to offer the use of these products as a service? This would involve maintaining your leased-out products and repairing/replacing them when they break, and you charge the client a recurring fee. It is a model gaining in popularity, and it encourages circularity, longer product lifespans and product quality.",
            "type": "information",
            "goesTo": "branch_pd_2"
        },
        "branch_pd_2": {
            "bodyText": "How easy is it to break your product back down into its components, for e.g. repair or salvaging parts?",
            "type": "multipleChoice",
            "choices": [
                {
                    "text": "Not easy at all: it is not supposed to be broken apart.",
                    "goesTo": "branch_pd_2.1"
                },
                {
                    "text": "This is not something we take into consideration.",
                    "goesTo": "branch_pd_2.2"
                },
                {
                    "text": "This is not applicable for my product.",
                    "goesTo": "branch_pd_3"
                },
                {
                    "text": "Easy: it is designed with ease of repair/refurbishing in mind.",
                    "goesTo": "branch_pd_2b"
                }
            ]
        },
        "branch_pd_2.1": {
            "bodyText": "Consider the material cost for making a new product from scratch instead of e.g. making one with parts from another product. You stand to gain brand popularity as a repair-friendly producer if you make your products easy to take apart.",
            "type": "information",
            "goesTo": "branch_pd_3"
        },
        "branch_pd_2.2": {
            "bodyText": "Consider taking ideas for product repair and refurbishment into the design of your products: by making them easy to repair or refurbish, you stand to gain brand popularity, and you can market it as repairable/mark up the price for the feature.",
            "type": "information",
            "goesTo": "branch_pd_3"
        },
        "branch_pd_2b": {
            "bodyText": "Do you collect old parts/products to repair/refurbish yourself, or are you connected to repair shops who take up this process for your products?",
            "type": "multipleChoice",
            "choices": [
                {
                    "text": "Yes.",
                    "goesTo": "branch_pd_3"
                },
                {
                    "text": "No.",
                    "goesTo": "branch_pd_2b.1"
                }
            ]
        },
        "branch_pd_2b.1": {
            "bodyText": "You could look into creating/managing repair shops for your products. This can improve your brand's public image, and you can keep control over where your products go and what happens to them.",
            "type": "information",
            "goesTo": "branch_pd_3"
        },
        "branch_pd_3": {
            "bodyText": "Does your product design take remanufacturing or recycling into account?",
            "type": "multipleChoice",
            "choices": [
                {
                    "text": "Yes.",
                    "goesTo": "branch_pd_end"
                },
                {
                    "text": "No.",
                    "goesTo": "branch_pd_3.1"
                }
            ]
        },
        "branch_pd_3.1": {
            "bodyText": "Consider taking remanufacturing and recycling into account when designing your products. They will eventually reach the end of their lifecycle, and when that happens, they will need to be disposed of, or if possible, transformed into something else. When you design your product with this in mind, you will make your long-time customers happy, and you will gain brand popularity as an environmentally conscious company.",
            "type": "information",
            "goesTo": "branch_pd_end"
        },
        "branch_pd_end": {
            "bodyText": "",
            "type": "final"
        },


        "branch_sc_start": {
            "bodyText": "How much control do you have over your supply chain?",
            "type": "multipleChoice",
            "choices": [
                {
                    "text": "Little to no control: the material I need is rare/not produced by many people at all.",
                    "goesTo": "branch_sc_1.1"
                },
                {
                    "text": "Some control: there are a decent amount of sources for my material.",
                    "goesTo": "branch_sc_1.1"
                },
                {
                    "text": "High amount of control: I can be picky with the source for my material, because there are many suppliers.",
                    "goesTo": "branch_sc_1b"
                },
                {
                    "text": "Total control: I produce the material myself.",
                    "goesTo": "branch_sc_1b"
                }
            ]
        },
        "branch_sc_1.1": {
            "bodyText": "You may want to look into using a different material or material mix. Relying on few sources may end you up in a difficult situation, if they happen to go out of business at some point, or lower their output.",
            "type": "information",
            "goesTo": "branch_sc_2"
        },
        "branch_sc_1b": {
            "bodyText": "Do you have a set of regulations/code of conduct you require your suppliers to adhere to?",
            "type": "multipleChoice",
            "choices": [
                {
                    "text": "Yes: I only purchase socially responsible materials. All workers in my supply chain need to be treated well and receive a good wage.",
                    "goesTo": "branch_sc_2"
                },
                {
                    "text": "Yes, but we do not strictly enforce this.",
                    "goesTo": "branch_sc_1b.1"
                },
                {
                    "text": "No, we do not have such a structure at this time.",
                    "goesTo": "branch_sc_1b.2"
                }
            ]
        },
        "branch_sc_1b.1": {
            "bodyText": "There have been scandals coming out about companies who say their products are made responsibly, but who do not bother to check anything, or worse, only say that as a front. Take up your social responsibility and ensure that everyone involved in the creation of your product can live off of it.",
            "type": "information",
            "goesTo": "branch_sc_2"
        },
        "branch_sc_1b.2": {
            "bodyText": "It is worth looking into, as it will make your own direct employees feel better about being employed with you, and give them more of a sense of purpose (see also the HR employee well-being branch).",
            "type": "information",
            "goesTo": "branch_sc_2"
        },
        "branch_sc_2": {
            "bodyText": "From where does your material come?",
            "type": "multipleChoice",
            "choices": [
                {
                    "text": "I use locally sourced material.",
                    "goesTo": "branch_sc_3"
                },
                {
                    "text": "I use imported material from further away.",
                    "goesTo": "branch_sc_2.1"
                },
                {
                    "text": "I buy whatever I can find.",
                    "goesTo": "branch_sc_2.2"
                }
            ]
        },
        "branch_sc_2.1": {
            "bodyText": "Consumers and lawmakers are becoming more aware of the carbon footprint of importing material. It may be worth to try to get ahead of the taxes and change your used material to something you can source locally instead.",
            "type": "information",
            "goesTo": "branch_sc_3"
        },
        "branch_sc_2.2": {
            "bodyText": "If you are uncertain about your supply of material, it is a good idea to look into changing your material (mix). Think about the properties of what you use right now, what your product needs, and what is more easily/widely available to you.",
            "type": "information",
            "goesTo": "branch_sc_3"
        },
        "branch_sc_3": {
            "bodyText": "Is the material you use sustainable/it does not pollute its environment when used/extracted?",
            "type": "multipleChoice",
            "choices": [
                {
                    "text": "Yes, it is sustainable and not damaging to the environment.",
                    "goesTo": "branch_sc_4"
                },
                {
                    "text": "Mostly: I cannot use truly sustainable materials (due to required properties of my products), but I am doing the next best thing.",
                    "goesTo": "branch_sc_3.1"
                },
                {
                    "text": "No/not really.",
                    "goesTo": "branch_sc_3.2"
                }
            ]
        },
        "branch_sc_3.1": {
            "bodyText": "If you cannot use truly sustainable materials for your current product, see if you can rethink the design. Is it really required for this product, or is it just required for your current implementation of it?",
            "type": "information",
            "goesTo": "branch_sc_4"
        },
        "branch_sc_3.2": {
            "bodyText": "Earth is running out of certain materials, and others are heavy pollutants. As lawmakers and consumers become more aware of this, get ahead of the inevitable taxes and see if you can change the material you use and/or the product design to use more sustainable resources.",
            "type": "information",
            "goesTo": "branch_sc_4"
        },
        "branch_sc_4": {
            "bodyText": "Do you waste a lot of material during production?",
            "type": "multipleChoice",
            "choices": [
                {
                    "text": "No: nothing is wasted.",
                    "goesTo": "branch_sc_end"
                },
                {
                    "text": "Some material is lost during production, but we cannot refine it further.",
                    "goesTo": "branch_sc_4.1"
                },
                {
                    "text": "We have not put thought into refining our production pipeline.",
                    "goesTo": "branch_sc_4.2"
                }
            ]
        },
        "branch_sc_4.1": {
            "bodyText": "Losing material is uneconomical. You might be able to do something else with the material instead of using it for its original purpose - see the concept of Industrial Symbiosis, or produce something else entirely with it.",
            "type": "information",
            "goesTo": "branch_sc_end"
        },
        "branch_sc_4.2": {
            "bodyText": "Being able to use all the material you buy, not having to throw any of it out, is an economical advantage. Look into ways for your pipeline to be more optimised material-wise, or get creative and design new products with the material leftovers from the original ones.",
            "type": "information",
            "goesTo": "branch_sc_end"
        },
        "branch_sc_end": {
            "bodyText": "",
            "type": "final"
        }
    }
}